<script>
import Header from './components/Header.vue';
import Footer from './components/Footer.vue';
import Main from './components/Main.vue';

export default {
  components: { Header, Footer, Main },
  data () {
    return {
      searchQuery: '',
      cards: [
      {
          id: 1,
          title: "Рождение Венеры",
          artist: "Сандро Боттичелли",
          price: "1 000 000 $",
          discount: "2 000 000$",
          image: "/images/bottichelli.png",
          alt: "Рождение Венеры",
          description: "«Рождение Венеры» — картина итальянского художника флорентийской школы Сандро Боттичелли. Представляет собой живопись темперой на холсте размером 172,5 × 278,5 см. В настоящее время хранится в галерее Уффици во Флоренции. Картина иллюстрирует миф рождения Венеры (греч. Афродиты). Обнажённая богиня плывёт к берегу в створке раковины ребристой сердцевидки или морского гребешка, подгоняемая ветром. В левой части картины Зефир (западный ветер) в объятиях своей супруги Хлориды (римский аналог — Флора) дует на раковину, создавая ветер, наполненный цветами. На берегу богиню встречает одна из граций.",
        },
        {
          id: 2,
          title: "Тайная вечеря",
          artist: "Леонардо да Винчи",
          price: "3 000 000 $",
          discount: "",
          image: "/images/daVinchi.png",
          alt: "Тайная вечеря",
          description: "«Тайная вечеря» Леонардо Да Винчи — монументальная роспись, изображающая сцену последней трапезы Христа со своими учениками. История создания: роспись была создана в 1495–1498 годы в доминиканском монастыре Санта-Мария-делле-Грацие в Милане. Работа была заказана Леонардо его патроном, герцогом Лодовико Сфорца и его супругой Беатриче д’Эсте.",
        },
        {
          id: 3,
          title: "Сотворение Адама",
          artist: "Микеланджело",
          price: "5 000 000 $",
          discount: "6 000 000 $",
          image: "/images/mikelangelo.png",
          alt: "Сотворение Адама",
          description: "«Сотворение Адама» (итал. La creazione di Adamo) — фреска Микеланджело, написанная около 1511 года. Фреска является четвёртой из девяти центральных композиций потолка Сикстинской капеллы, посвящённых девяти сюжетам книги Бытия. Она иллюстрирует эпизод: «И сотворил Бог человека по образу Своему» (Быт. 1:27).",
        },
        {
          id: 4,
          title: "«Урок анатомии» ",
          artist: "Рембрандт",
          price: "Продана на аукционе",
          discount: "",
          image: "/images/rembrant.png",
          alt: "Урок анатомии",
          description: "Центральная фигура картины — доктор Николас Тульп, который показывает собравшимся устройство мускулатуры руки человека. Труп — Адриаан Адриаанс по прозвищу Арис Киндт (Малыш). В своё время он тяжело ранил в Утрехте тюремного охранника и в Амстердаме избил и ограбил человека. За это 31 января 1632 года он был повешен и передан для публичной аутопсии амстердамской гильдии хирургов.",
        }
      ]
    };
  },
  methods: {
    updateSearch(query) {
      this.searchQuery = query;
    }
  }
}
</script>

<template>
  <div className="page">
    <Header :searchQuery="searchQuery" :onSearch="updateSearch"/>
    <Main :cards="cards" :searchQuery="searchQuery"/>
    <Footer/>
  </div>
</template>

<style scoped>
  .page {
    display: flex;
    flex-direction: column;
    align-items: center;
  }
</style>
